esp-cpp/espp/components/usb_device/msc_example/sdkconfig.defaults
# This example uses the native USB-OTG peripheral, which is only available on the
# ESP32-S3 (also S2 / P4) -- NOT the classic ESP32.
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Console on UART0: on the ESP32-S3 USB-Serial-JTAG shares the native USB port's
# PHY with USB-OTG, which TinyUSB takes over for the mass storage interface. Use a
# USB-UART adapter on UART0 for `idf.py monitor`; USB-Serial-JTAG stays the
# secondary console so early-boot logs are visible before TinyUSB starts.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

# Mass storage only: no CDC.
CONFIG_TINYUSB_CDC_ENABLED=n
CONFIG_TINYUSB_CDC_COUNT=0
CONFIG_TINYUSB_MSC_ENABLED=y

# Flash FAT volume: 512-byte wear-levelling sectors, so they fit the default
# 512-byte MSC buffer (esp_tinyusb requires TINYUSB_MSC_BUFSIZE >= WL sector).
CONFIG_WL_SECTOR_SIZE_512=y
CONFIG_WL_SECTOR_MODE_PERF=y
CONFIG_FATFS_LFN_HEAP=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
